# 1) მომხმარებელს შემოატანინეთ სიტყვა.  
# -> იტერაციით გაიარეთ თითო ასო  
# -> თუ შეხვდებით ასო 'e'-ს ან 'E'-ს გაჩერდით (break)  
# -> დაბეჭდეთ მხოლოდ ის ასოები, რაც მანამდე იყო  

text = input("შეიყვანე სიტყვა: ")

for i in text:
    if i == "e" or i == "E":
        break
    print(i)



# 2) მომხმარებელს შემოატანინეთ წინადადება.  
# -> შეამოწმეთ არის თუ არა ტექსტში სიტყვა 'bad'  
# -> თუ არის, დაპრინტეთ "აკრძალული სიტყვა!"  
# -> თუ არაა, დაპრინტეთ "ყველაფერი რიგზეა"  

Text = input("შეიყვანე სიტყვა: ")

if "bad" in Text:
        print("აკრძალული სიტყვა!")
else:
    print("ყველაფერი რიგზეა")



# 3) მომხმარებელს შემოატანინეთ წინადადება.  
# -> დაუარეთ ტექსტს for ციკლით  
# -> გამოტოვეთ ყველა space => ' '
# -> დაბეჭდეთ ყველა დანარჩენი სიმბოლო  

tExt = input("შეიყვანე სიტყვა: ")

for i in tExt:
    if i ==" ":
          continue
    print(i)



# 4) მომხმარებელს შემოატანინეთ წინადადება.  
# -> დაუარეთ მას for ლუპით  
# -> გამოტოვეთ ხმოვნები (a, e, i, o, u)  
# -> დაბეჭდეთ მხოლოდ თანხმოვნები და თავისთავათ ყველა სხვა სიმბოლო 


teXt = input("შეიყვანე სიტყვა: ")

for i in teXt:
    if i in teXt == "a" or i in teXt == "u" or i in teXt == "i" or i in teXt == "o" or i in teXt == "u":
        continue
    else:
         print(teXt)



# 5) მომხმარებელს შემოაყვანით ორი რიცხვი
# --> დაუარეთ ყველა რიცვს ამ დიაპაზონში
# --> დაბეჭდეთ მხოლოდ რიგით პირველი რიცხვი ამ შუალედში რომელიც იყოფა 15-ზე(შეწყვიტეთ ციკლი თუ არის ეგეთი)

num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))

for i in range(num1, num2 + 1):
    if i % 15 == 0:
        print("პირველი რიცხვი რომელიც იყოფა 15-ზე არის:", i)
        break




# 6) შექმენით უსასრულო while loop:
# --> სანამ მომხმარებელი არ შემოიყვანს 'python is best', მანამდე დაპრინტეთ 'you should learn python'

while True:
    text = input("შეიყვანე ტექსტი: ")
    if text == "python is best":
        break
    print("you should learn python")




# 7) \<.BOSS.>/ 
# მომხმარებელს შემოაყვანით ორი რიცხვი
# --> დაუარეთ ყველა რიცვს ამ დიაპაზონში
# --> დაბეჭდეთ მხოლოდ რიგით მესამე რიცხვი ამ შუალედში რომელიც იყოფა 3-ზე(შეწყვიტეთ ციკლი თუ არის ეგეთი)

num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))

count = 0

for i in range(num1, num2 + 1):
    if i % 3 == 0:
        count += 1
        if count == 3:
            print("მესამე რიცხვი რომელიც იყოფა 3-ზე არის:", i)
            break
