# საბანკო პროექტი bog group - 1 
correct_password = "jixvi33"
password_attempts = 0 # საწყისი მცდელობების რაოდენობა
max_password_attempts = 3 # მაქსიმალური მცდელობა 
balance = 0
#პაროლის შემოწმება
while password_attempts < max_password_attempts:
    password = input("შეიყვანეთ თქვენი პაროლი: ")
    if password == correct_password:
        print("სისტემაში სესვლა წარმატებით განხორციელდა!!!")
        break
    #მცდელობების გაზრდა
    else:
        password_attempts +=1 
        print(f"პაროლი არასწორია{password_attempts}/{max_password_attempts}") # შეცდომის შეტყობინება 
else: #თუ ყველა მცდელობა გამოყენებულია 
    print("სისტემაში შევლის მცდელობა ამოწურულია!!!")# ანგარიში დაბლოკილია 
    
#დამატებითი ბანკის ოპერაციები (menu)
print("----------Bank of GOA-------------")
print("1 - ვალუტის კონვერტაცია") # ვალუტის კონვერტაციის მონაცემი
print("2 - პროცენტის დეპოზიტზე დარიცხვა") # მონაცემი პროცენტის დეპოზიტზე დასარიცხად 
print("3 - სესხის სიმულაცია")
print("4 - თანხის ანგარიშზე შეტანა")# მონაცემი სესხის 
print("5 - თანხის ანგარიშიდან გამოტანა")# მონაცემი თანხის ანგარიშიდან გამოისატანად 
print("6 - ანგარიშის ბალანსის ნახვა") # ანგარიშის ბალანსის ნახვა
print("7 - ანგარიშის დახურვა") # ანგარიშის დახურვა
choice = input("აირჩიეთ ოპერაცია 1/2/3/4/5/6/7: ") # მომხმარებლის არჩევანი

# ვალუტის კონვერტაცია 
if choice == "1":
    print("ვალუტის კონვერტაცია")
    amount = float(input("შეიყვანეთ თანხა: "))
    print("აირჩიეთ ვალუტა")
    print("1-ლარის - დოლარში გადაცვლა")
    print("2-ლარის -ევროში გადაცვლა")
    currency_choice = input("აირჩიეთ 1 ან 2 ") # ვალუტის არჩევა
    if currency_choice == "1": # არჩევანი 
        rate = 2.70 # კურსი
        converted = amount/rate # შეფარდება რაოდენობასა და ვალუტის კურსს შორის
        print(f"{amount}ლარი = {converted:.2f}დოლარი") # შედეგი (# :.2f - ეს არის თუ ათწილადი რამდენი რიცხვით უნდა
                                                         #ჩაიწეროს მაგ 13.143256 ჩაიწერება როგორც 13.14 
    elif currency_choice =="2": # არჩევანი
        rate = 3.10 #ვალუტის კურსი
        converted = amount/rate # შეფარდება რაოდენობასა და ვალუტის კურსს შორის
        print(f"{amount}ლარი = {converted:.2f}ევრო") # შედეგი
# დეპოზეიტზე პროცენტის დარიცვა 
elif choice == "2":
    print("პროცენტის დეპოზიტზე დარიცხვა")
    deposit = float(input("შეიყვანეთ დეპოსიტზე დასარიცხი თანხა: "))# თანხა რომელიც დეპოზიტზე უნდა დაირიცხოს
    interest_rate = float(input("შეიყვანეთ პროცენტი: ")) # პროცენტის შესატანი განყოფილება
    months = int(input("შეიყვანეთ თვეების რაოდენობა: ")) # თვეების რაოდენობა რა დროშიც უნდა დაიფაროს პროცენტი

    interest = deposit * (interest_rate / 100) + (months /12) # პროცენტის გამოსათვლელი ფორმულა 
    total = deposit + interest 
    print(f"დეპოსიტის ჯამი{months} თვეში:{total:.2f}") # შედეგი
    # სესხის სიმულაცია 
elif choice =="3": 
    print("სესხი")
    loan_amount = float(input("შეიყვანეთ თანხა: "))
    loan_rate = float(input("შეიყვანეთ წლიური პროცენტი: "))
    loan_years = int(input("შეიყვანეთ ვადა(წლებში): "))

# მარტივი პროცენტის გამოთვლა სესხი + პროცენტი 
    total_to_pay = loan_amount + (1 + loan_rate/100 ) # 1 ამ შემთხვევაში მთლიამნი ძირი თანხის 100% ანუ უბრალოდ კოეფიციენტი  
    monthly_payment = total_to_pay/loan_years/(loan_rate*12) # თვიური გადახდა 
    print(f"სესხის ჯამი {loan_years} წელში {total_to_pay:.2f}")
    print(f"თვიური გადახდა:{monthly_payment:.2f}")


elif choice == "4":  # თანხის ანგარიშზე შეტანა
    amount = float(input("შეიყვანეთ თანხა, რომელიც გსურთ ჩარიცხოთ: "))
    balance += amount  # ბალანსზე თანხის დამატება
    print(f"{amount} ლარი ჩაგერიცხათ. ახალი ბალანსი: {balance} ლარი")

elif choice == "5":  # თანხის ანგარიშიდან გამოტანა
    amount = float(input("შეიყვანეთ თანხა, რომელიც გსურთ გამოიტანოთ: "))
    if amount > balance:  # თუ თანხა ბალანსზე მეტია
        print("თქვენ არ გაქვთ საკმარისი თანხა ამ ოპერაციისთვის!")
    else:
        balance -= amount
elif choice == "6": # ანგარიშის შემოწმება 
    print(f"თქვენი ბალანსია: {balance} ლარი") 
# ანგარიშის დახურვა 
elif choice =="7":
    print("ანგარიშიდან გამოსულიხართ!!! ")

else:      # თუ მომხმარებელმა არასწორად შეარჩია
    print("არასწორი !!!") 