#  1) შევქმნათ 2 ცვლადი snake_case ის გამოყენებით, მივანიჭოთ ამ ცვლადებს ინტეჯერ ტიპის მონაცემები(რიცხვები), ჩვენი დავალებაა რომ ამ ორ 
#  ცვლადზე მოვახდინოთ მათემატიკური ოპერაციები(+ - * /) და ეს ოპერაციები შევინახოთ სხვა ცვლადებში რომლებიც იქნებიან შექმნილები ასევე snake_case
#  ის გამოყენებით 

x_angle = 132
y_angle = 111

x_y_angle = x_angle + y_angle
x_y_angle_1 = x_angle - y_angle
x_y_angle_2 = x_angle / y_angle
x_y_angle_3 = x_angle * y_angle


# 2)  შევქმნათ ცვლადი სახელად name რომელსაც მივანიჭებთ მნიშვნელობას ჩვენს სახელს, ჩვენი დავალებაა რომ ეს ცვლადი განვააახლოთ 5 ჯერ და დავპრინტოთ
#  ამ ცვლადის საბოლოო მნიშვნელობა

name = "Giga"
name = "Dexter"
name = "Debra"
name = "Brian"
name = "Rita"

print(name)

# 3) შევქმნათ 5 ცვლადი რომელსაც ერქმევა ერთი სახელი მაგრამ იქნება case sensitive, რაც იმას ნიშნავს რომ ამ ცვლადებში მყოფი ასოები იქნება ზოგი დიდი
#  ზოგი პატარა, ანუ ეს 5 ივე ცვლადი იქნება სხვადასხვა ცვლადები, დავპრინტოთ 5 ივე მათგანი და გამოვიტანოთ პასუხი ტერმინალში

car = "bmw"
Car = "audi"
cAr = "bentley"
caR = "lamborghini"
CAr = "porsche"

print(car)
print(Car)
print(cAr)
print(caR)
print(CAr)


# 4) გავასოწროთ შემდეგი ცვლადები და მნიშვნელობები, კომენტარის სახით მივუწეროთ თუ რა არის შეცდომა და შევასწოროთ

#2name = "giorgi"          # არ შეიძლება იწყებოდეს ცვლადის სახელი რიცხვით
#user{name = "bubunauri"   # არ შეიძლება სიტყვები ერთმანეთისგან გამოიყოს რაიმე ნებისმიერი სიმბოლოთი ან რიცხვით, გარდა ქვედა ტირისა
#user_name = goga          # მნიშვნელობა უნდა იყოს ბრჭყალებში
#user-surname = axalaia    # იგივე რაც მე 2 და მე 3 კოდში, ტირეს მაგივრად ქვედა ტირეა საჭირო და მნიშვნელობა უნდა იყოს ბრჭყალებში

# ეხლა გავასწოროთ ზემოთ მოცემული კოდები

name = "giorgi"
user_name = "bubunauri"
user_name = "goga"
user_surname = "axalaia"


# 5) შევქმნათ 5 ცვლადი რომელიც იქნება snake_case ით დაწერილი, მივანიჭოთ სტრინგ ტიპის მონაცემები, ჩვენი დავალებაა რომ გამოვიტანოთ ამ 5 ცვლადის 
#  მნიშვნელობა ერთ გრძელ წინადადებად, კომენტარის სახით მივუწეროთ რა ქვია ამ მოქმედებას როდესაც სტრინგებს ვაერთებთ

car_1 = "bmw"
car_2 = "rollsroyce"
car_3 = "maybach"
car_4 = "audi"
car_5 = "lamborghini"

print(car_1 + car_2 + car_3 + car_4 + car_5)  #  ამას ეწოდება კონკატინაცია




# 6) შევქმნათ 2 ცვლადი, ერთში შევინახოთ ჩვენი სახელი მეორეში კი რიცხვი 10, ჩვენი დავალებაა ჩვენი სახელი გამოიტანოთ ტერმინალში 10 ჯერ, 
# მოვახდინოთ შესაბამისი მათემატიკური ოპერაცია 

name = "Giga"
number = 10
print(name * number)

# 7) კომენტარის სახით ავხსნათ თუ რომელი მათემატიკური მოქმედებების შესრულება არ შეგვიძლია სტრინგზე და ინტეჯერზე და რას მოგვცემს შედეგად

#  სტრინგზე და ინტეჯერზე არ შეიძლება მათემატიკური ოპერაციების შესრულება როგორიცაა: მიმატება ( + ), გამოკლება ( - ) და გაყოფა ( / )

#  რადგან მივიღებთ შეცდომას (ბაგს, ერორს) სახელად Typeerror, მაგრამ შეგვიძლია გამრავლება, თუ კოდს დავწერთ ასეთს: 

name = "Giga"
number = 2
print(name * number)

# ჩვენი ტერმინალზე მიღებული შედეგი იქნება ორჯერ დაწერილი გიგა ანუ GigaGiga.


