# 1) კომენტარის სახით ახსენი თუ რომელი ოპერატორები ვისწავლეთ და რა დანიშნულება აქვთ მათ


# >, <, == შედარების ოპერატორები
# მინიჭების ოპერატორი   = ; ანიჭებს მნიშვნელობას მაგ: num = 3, ცვლადს მივანიჭეთ მნიშვნელობა
# >, ეს არის მეტობის ოპერატორი რომელიც გვეუბნება რომ ერთი მოცემული მნიშვნელობა მეტია მეორეზე
# <, ეს არის ნაკლებობის ოპერატორი რომელიც გვიჩვენებს რომ ერთი მოცემული მნიშვნელობა ნაკლებია მეორეზე
# ==, ეს არის ტოლობის ოპერატორი რომლითაც შეგვიძლია გავუტოლოთ ერთნნაირი მნიშვნელობები


# 2) მომხმარებელს შემოაყვანინეთ ორი რიცხვი,შეადარეთ თუ პირველი რიცხვი მეტია მეორეზე,ასევე შეადარე თუ პირველი რიცხვი ნაკლებია მეორე რიცხვზე
# და ასევე შეადარე თუ პირველი რიცხვი უდრის მეორე რიცხვს


num1 = int(input("Type your first num"))
num2 = int(input("Type your second num"))

operation1 = num1 > num2
print(operation1)

operation2 = num1 < num2
print(operation2)

operation3 = num1 == num2
print(operation3)



# 3) მომხმარებელს შემოატანინეთ 5 სტრინგ ტიპის მნიშვნელობა,შენი დავალებაა მოახდინო მათი კონკატინაცია

wrd1 = input("Type your first word")
wrd2 =input("Type your second word")
wrd3 = input("Type your third word")
wrd4 = input("Type your fourth word")
wrd5 = input("Type your fifth word")

print(wrd1 + wrd2 + wrd3 + wrd4 + wrd5)




#  4) მომხმარებელს შემოატანინე 4 რიცხვი,შენი დავალებაა გაიგო ამ რიცხვების საშუალო არითმეტიკული

st = int(input("Type your first num"))
nd = int(input("Type your second num"))
rd = int(input("Type your third num"))
th = int(input("Type your fourth num"))

print((st + nd + rd + th) / 5)



# 5) შექმენი 4 ცვლადი,ამ ცვლადებშ შეინახე 4 განსხვავებული მონაცემთა ტიპის ელემენტები და დაპრინტე მათ ტიპი(გამოიყენეთ შესაბამისი ფუნქცია)

# 4 სხვადასხვა ტიპის ცვლადი
x = 10              # მთელი რიცხვი (int)
y = 3.14            # ათწილადი (float)
z = "Hello"         # სტრინგი (str)
t = True            # ბულური მნიშვნელობა (bool)

# ვბეჭდავთ მათ ტიპებს
print(type(x))  # <class 'int'>
print(type(y))  # <class 'float'>
print(type(z))  # <class 'str'>
print(type(t))  # <class 'bool'>



# 6) შექმენი 2 ცვლადი,შეინახე ორივე ცვლადში სტრინგ ტიპის მნიშვნელობები და შეადარე ისინი არიან თუ არა ერთნაირები

num_1 = "5"
num_2 = "5"

print(num_1 == num_2)


# 7) შექმენი 4 ცვლადი,სადაც გექნება მოთავსებული რიცხვები ოღონდ სტრინგის სახით მაგ: "40",გადაიყვანე ეს სტრინგი რიცხვები ინტეჯერში და გაიგე 
# ამ ოთხი რიცხვის ჯამი


q = "10"
w = "20"
e = "30"
r = "60"

# თითოეული სტრინგი ინტად გადავაქციოთ
sum_result = int(q) + int(w) + int(e) + int(r)

print(sum_result)  # შედეგი: 120



# 8) შექმენი 3 ცვლადი,ამ ცვლადებში შეინახეთ ინტეჯერ ტიპის მონაცემები,შენი დავალებაა ეს რიცხვები გაასტრინგო(გამოიყენე შესაბამისი ფუნქცია) და
#  გამოიტანო ეს რიცხვები ერთ წინადადებაში. მაგ:304050

frstnum = "5"
scndnum = "10"
thrdnum = "15"

int(frstnum)
int(scndnum)
int(thrdnum)

print(frstnum + scndnum + thrdnum)
