# 1) კომენტარის სახით ახსენი თუ რომელი ოპერატორები ვისწავლეთ და რა დანიშნულება აქვთ მათ

# >, <, == შედარების ოპერატორები
# მინიჭების ოპერატორი   = ; ანიჭებს მნიშვნელობას მაგ: ნუმ = 3, ცვლადს მივანიჭეთ მნიშვნელობა
# > ; მეტობის ოპერატორი რომელიც აღნიშნავს რომ ერთი მნიშვნელობა მეტია მეორეზე
# < ; ნაკლებობის ოპერატორი რომელიც აღნიშნავს რომ ერთი მნიშვნელობა ნაკლებია მეორეზე
# == ; ტოლობის ოპერატორი რომელიც გვიტოლებს ორ ერთნაირ მნიშვნელობას




# 2) მომხმარებელს შემოაყვანინეთ ორი რიცხვი,შეადარეთ თუ პირველი რიცხვი მეტია მეორეზე,ასევე შეადარე თუ
#  პირველი რიცხვი ნაკლებია მეორე რიცხვზე,და ასევე შეადარე თუ პირველი რიცხვი უდრის მეორე რიცხვს

num1 = int(input("Type your first number"))
num2 = int(input("Type your second number"))

operation1 = num1 > num2
operation2 = num1 < num2
operation3 = num1 == num2

print(operation1)
print(operation2)
print(operation3)
