# 1) for ციკლის მეშვეობით გამოიტანეთ რიცხვები 10-ის ჩათვლით

for i in range(11):
    print(i)


# 2) while ციკლის მეშვეობით გამოიტანეთ რიცხვები 5-დან 20-მდე.

num = 5
while num < 20:
    print(num)
    num = num + 1



# 3) კომენტარების სახით ახსენით რა არის conditional statement, რა დანიშნულება გააჩნიათ და როგორი სახის განცხადებები გვაქვს.

# Conditional statement (პირობითი განცხადება) არის პროგრამირების კონსტრუქცია,
# რომელიც საშუალებას გვაძლევს, რომ კოდის გარკვეული ნაწილი შესრულდეს მხოლოდ მაშინ,
# თუ მოცემული პირობა (condition) არის True (ჭეშმარიტი).

# სახის განცხადებები Python-ში:
# 1) if — თუ პირობა ჭეშმარიტია, შესრულდება კოდი if ბლოკში.
# 2) if ... else — თუ პირობა ჭეშმარიტია, შესრულდება if-ის კოდი, თუ არა — else-ის კოდი.

# მაგალითი:
age = 18

if age >= 18:
    print("სრულწლოვანი ხარ")  # შესრულდება თუ პირობა True-ა
else:
    print("არასრულწლოვანი ხარ")  # შესრულდება თუ პირობა False-ა


# 4) მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ თუ ასაკი იქნება მეტი ან ტოლი 18-ის მაშინ გამოუტანოს რომ
#  იგი ზრდასრულია, ხოლო თუ იქნება 18-ზე ნაკლები საბოლოო გზის მეშვეობით გამოუტანეთ რომ ის მოზარდია.


age = input("Enter your age:")

if int(age) >= 18:
    print("You are adult")
else:
    print("You are teenager")

