# 1)შექმენით 10 ელემენტიანი სია, და ამ სიიდან ბოლო 5 ელემენტი გამოიტანეთ დადებითი სლაისინგით

# 1) 10 ელემენტიანი სია
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# ბოლო 5 ელემენტის გამოძახება დადებითი სლაისინგით
last_five = my_list[5:10]

print(last_five)


# 2)შექმენით 20 ელემენტიანი სია, და ამ სიიდან პირველი 11 ელემენტი გამოიტანეთ ყაროფიტითი ინდექსებით

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

# პირველი 11 ელემენტის გამოძახება უარყოფითი ინდექსებით

print(my_list[-20:-9])


# 3)შექმენით 12 ელემენტიანი სია, და მომხარებელს შემოატანინე რიცხვი, შემდეგ 2 იდან მომხარებლის შემოტანილ რიცხვამდე გამოიტანე ყველა ელემენტი

# 12 ელემენტიანი სია
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

# მომხმარებლისგან რიცხვის შემოტანა
user_input = int(input("შეიყვანე რიცხვი: "))

print(my_list[2:user_input])

