# 1) დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 

for i in range(39):
    print(i)


# 2) დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 
 

for i in range(30,40):
    print(i)



# 3) დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 


for i in range(12,120):
    print(i)





# 4) დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ ასევე გამოიტანეთ თქვენი ასაკიც,ერთ for ციკლში მოათავსეთ ორივე და ეგრე გააკეთეთ



saxeli = "გიგა"
asaki = 15

for i in range(18):
    print("სახელი:", saxeli, "ასაკი:", asaki)




# 5) დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში

for i in range(10,100,3):
    print(i)





# 6) ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ ,მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი

for i in range(30):
    print(str(i) + "ანანასი")




# 7) მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop


for i in range(13):
    input("Enter your name:")






# 8) გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით


i = 0 
while i < 10:
    print("გიგა")
    i = i + 1




# 9) დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop


i = 0
while i < 24:
    print(i)
    i += 1




# 10) იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ
     
    #1 გამოვიტანოთ საოცნებო მანქანა 50 ჯერ
    #2 გამოვიტანოთ მანქანა რომელიც არ მოგვწონს 15 ჯერ
    #3 გამოვიტანოთ მანქანა რომელსაც საპირველოდ ვიყოლიებდი 40 ჯერ
    #4 გამოვიტანოთ საყვარელი მანქანის კომპანიის, ერთერთი მდიდრული მოდელი 45 ჯერ



for i in range(50):
    print("BMW M5 F90 2025")


for i in range(15):
    print("Supra MK5")


for i in range(40):
    print("BMW M5 F10 2016")


for i in range(45):
    print("BMW XM Label Red 2025")




