# 1) მომხმარებელს შემოატანინე სიტყვა ანდა ტექსტი. -> გაიგე ამ სიტყვის/ტექსტის სიგრძე და დაპრინტე -> for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.

text = input("შეიყვანე სიტყვა ან ტექსტი: ")

print("სიგრძე:", len(text))

for letters in text:
    print(letters)



# 2) შექმენით სია სადაც შეინახავთ სტრინგებს. დაუარეთ სიის თითოეულ ელემენტს: 1. დაპრინტეთ რამდენი სიმბოლოსაგან შედგება სიტყვა 2. თუ სიტყვის სიგრძე არის: --> კენტი დაპრინტეთ 'კენტია' --> ლუწი დაპრინტეთ 'ლუწია'


words = ["კომპიუტერი", "მზე", "სიყვარული", "ცხვარი", "წიგნი"]

for word in words:
    length = len(word)
    print(f"სიტყვა: {word} -> სიგრძე: {length}")

    if length % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")








