#  1)  მომხმარებელს შემოაყვანიეთ რაიმე რიცხვი(მთელი/ათწილადი); შეამოწმეთ ეს რიცხვი - 
# --> თუ დადებითია დაპრინტეთ 'ეს რიცხვი დადებითი რიცხვია'
# --> თუ უარყოფითია დაპრინტეთ 'ეს რიცხვი უარყოფითი რიცხვია'
# --> თუ ნულია დაპრინტეთ 'ეს რიცხვი ნულია'

num = float(input("შეიყვანეთ ნებისმიერი რიცხვი:"))

if num > 0:
    print("ეს რიცხვი დადებითია")
elif num < 0:
    print("ეს რიცხვი უარყოფითია")
else:
    print("ეს რიცხვი ნულია")


#  2)  მომხმარებელს შემოაყვანიეთ თავისი ასაკი:
# 0–12 წლის ასაკი --> დაპრინტეთ 'ბავშვი ხარ'
# 13-19 წლის ასაკი --> დაპრინტეთ 'მოზარდი/თინეიჯერი ხარ'
# 20-64 წლის ასაკი --> დაპრინტეთ 'ზრდასრული ხართ'
# 65-120 წლის ასაკი --> დაპრინტეთ 'ხანში შესული ხართ'
# 120 და ზემოთ --> დაპრინტეთ 'გურუ ან ჯადოქარი'
# თუ შემოყვანილი ასაკი უარყოფითია --> დაპრინტეთ 'არასწორი ინფო'


age = int(input("შეიყვანეთ თქვენი ასაკი:"))

if age < 0:
    print("არასწორი ინფო")
elif age <= 12:
    print("შენ ხარ ბავშვი")
elif age <= 19:
    print("შენ ხარ მოზარდი")
elif age <= 64:
    print("თქვენ ზრდასრული ბრძანდებით")
elif age <= 120:
    print("ხანში შესული ბრძანდებით")
else:
    print("გურუ ან ჯადოქარი")


# 3) დაწერეთ "password guesser" პროგრამა, შექმენით რაიმე ცვლადი და მასში შეინახეთ ის პაროლი რომელსაც ყველგან იყენებთ ;)
# მომხმარებელს მოთხოვეთ გამოიცნოს თქვენი პაროლი
# აღნიშნეთ ცდების რაოდენობა
# გამოიყენეთ while loop, მანამ ატრიალეთ სანამ მომხმარებელი პაროლს არ გამოიცნობს ან დაწერს --> 'nah strong password'
# ბოლოს აჩვენეთ(დაუპრინტეთ) რამდენი ცდა დაჭირდა პაროლის გამოსაცნობად

#----------------------password-guesser----------------------#
# სწორი პაროლი
Pass = "modzalade"

#დანებება
surrend = "nah strong password"

# ცდების საწყისი რაოდენობა
attempts = 0

# ციკლი
while True:
    guessing = str(input("გამარჯობა, აკრიფეთ ნებისმიერი რამ, თქვენი მიზანია გამოიცნოთ ჩემი პაროლი, თუ გინდათ დანებდეთ აკრიფეთ (nah strong password):"))
    attempts = attempts + 1
    
    if guessing == Pass:
        print("ყოჩაღ, თქვენ გამოიცანით ჩემი პაროლი!")
        break
    elif guessing == surrend:
        print("ჰაჰაჰა, შენ დანებდი!")
        break
    else:
        print("პაროლი არასწორია თავიდან სცადეთ!")
# ცდების დაბეჭდვა
print(attempts)


# 4) მომხმარებელს შემოატანიეთ სამი რიცხვი(მთელი/ათწილადი) და ამ სამი რიცხვთაგან დაბეჭდეთ უდიდესი

num1 = float(input("შეიყვანეთ ნებისმიერი რიცხვი:"))
num2 = float(input("კიდევ 2 ჯერ:"))
num3 = float(input("კიდევ 1 ხელ:"))

# max_num = max(num1, num2, num3)
# print(f"უდიდესი რიცხვია: {max_num}")

if num1 > num2 and num1 > num3:
    print("პირველი რიცხვი არის უდიდესი")
elif num2 > num1 and num2 > num3:
    print("მეორე რიცხვი არის უდიდესი")
else:
    print("მესმე რიცხვი არის უდიდესი")

# 5) შემოატანიეთ მომხმარებელს რიცხვი 1-დან 7-ჩათვლით
# თუ 1 --> დაპრინტეთ 'ორშაბათი'
# თუ 2 --> დაპრინტეთ 'სამშაბათი'
# თუ 3 --> დაპრინტეთ 'ოთხშაბათი'
# თუ 4 --> დაპრინტეთ 'ხუთშაბათი'
# თუ 5 --> დაპრინტეთ 'პარასკევი' 
# თუ 6 --> დაპრინტეთ 'შაბათი'
# თუ 7 --> დაპრინტეთ 'კვირა' 
# სხვა დანარჩენი --> 'არ ვიცი ეგ რა დღეა'

a = "1"
b = "2"
c = "3"
d = "4"
e = "5"
f = "6"
g = "7"

day_number = input("შეიყვანეთ რიცხვი 1-დან 7-ჩათვლით")

if day_number == a:
    print("ორშაბათი")
elif day_number == b:
    print("სამშაბათი")
elif day_number == c:
    print("ოთხშაბათი")
elif day_number == d:
    print("ხუთშაბთი")
elif day_number == e:
    print("პარასკევი")
elif day_number == f:
    print("შაბათი")
elif day_number == g:
    print("კვირა")
else:
    print("არვიცი ეგ რა დღეა")