#1)მოცემულია სია --> [1, 2, 3, 4, 5, 6]
# შეცვალე შუა ორი ელემენტი რიცხვებით [10, 20, 30].

numbers = [1, 2, 3, 4, 5, 6]
numbers[2:4] = [10, 20, 30]
print(numbers)


# 2)მოცემულია სია --> ["apple", "banana", "cherry", "kiwi", "mango"]
# შეცვალე პირველი ორი ელემენტი სიით ["pear", "plum"].

list = ["apple", "banana", "cherry", "kiwi", "mango"]
list[:1] = ["pear", "plum"]
print(list)


# 3)ოცემულია სია --> ["a", "b", "c", "d", "e", "f"]
# შეცვალე ბოლო სამი ელემენტი სიით ["x", "y", "z"].

list1 = ["a", "b", "c", "d", "e", "f"]
list1[3:] = ["x", "y", "z"]
print(list1)


# 4)მოცემულია სია --> ["red", "green", "blue", "yellow", "black", "white"]
# შეცვალე ინდექსებზე 2-დან 5-მდე ელემენტები სიით ["purple", "orange"].

list2 = ["red", "green", "blue", "yellow", "black", "white"]
list2[2:] = ["purple", "orange"]
print(list2)


# 5)მოცემულია სია --> ["გიორგი" , "ირმა" , "საბა" ]
# შეცვალე მთლიანი სია შემდეგი სიით -->  ["red", "green", "blue", "yellow", "black", "white"]

list3 = ["გიორგი" , "ირმა" , "საბა" ]
list3 = ["red", "green", "blue", "yellow", "black", "white"]
print(list3)


# 6) მომხმარებელმა შეიყვანოს რიცხვი — შეამოწმე ლუწია თუ კენტი ეს რიცხვი , თუ ლუწია დაპრინტე --> "Even" ,თუ კენტია დაპრინტე --> "Odd".

num = int(input("Enter any number:"))

if num %2 == 0:
    print("Even")
else:
    print("Odd")


# 7)შექმენი სია --> სადაც შეინახავ ინტეჯერებს ,შემდეგ შეამოწმე თუ სიაში მყოფი მე3 ინდექსზე მდგომი ელემენტი არუს ლუწი დაპრინტე --> "Even number" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი დაპრინტე --> "Odd number"

numbers1 = [5, 8, 13, 22, 9, 10]

if numbers[3] % 2 == 0:
    print("Even number")
else:
    print("Odd number")



# 8)შექმენი სია სადაც შეინახავ ინტეჯერებს, თუ სიაში მყოფი ბოლო ელემენტი არის ლუწი და მეტი 50 ზე დაპრინტე --> "ეს რიცხვი არის ლუწი და მეტი 50 ზე" , თუ რიცხვი არის კენტი და ნაკლებია 50 ზე დაპრინტე --> "ეს რიცხვი არის კენტი და ნაკლები 50 ზე"

numbers2 = [5, 8, 13, 22, 9, 60]

if numbers2[-1] % 2 == 0 and numbers2[-1] >50 :
    print("ეს რიცხვი არის ლუწი და მეტი 50 ზე")
elif numbers2[-1] % 2 != 0 and numbers2[-1] < 50:
    print("ეს რიცხვი არის კენტი და ნაკლები 50 ზე")


# 9)შექმენი სია სადაც შეინახავ ინტეჯერებს,თუ სიაში მყოფი მე 5 ინდექსზე მდგომი ელემენტი არის ლუწი ან 100 ზე მეტი დაუპრინტე --> "even or more than 100" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი ან ნაკლები 100 ზე დაუპრინტე --> odd or less than 100


numbers3 = [5, 8, 13, 22, 9, 10]

if numbers3[5] %2 == 0 or numbers3[5] > 100:
    print("even or more than 100")
if numbers3[3] %2 != 0 or numbers3[3] < 100:
    print("odd or less than 100")



# 10)შექმენი ორი ცვლადი სადაც შეინახავთ სტრინგებს , შემდეგ შეადარე უდრის თუ არა ეს ორი ცვლადი ერთმანეთს , გამოიყენე ახლად ნასწავლი
# ოპერატორი != 

str1 = "Python"
str2 = "Python"

if str1 != str2:
    print("სტრინგები განსხვავდებიან")
else:
    print("სტრინგები ერთნაირია")















