# 1) შექმენით სია რომელშიც იქნება მხოლოდ int მონაცემთა ტიპის ელემენტები, ამ სიიდან ამოშალე ყოველი რიცხვი რომელიც არის ლუწი ან დგას კენტ
# ინდექსზე სიაში, გამოიყენეთ remove() ფუნქცია და for ციკლი.

nums = [1, 2, 3, 4, 5, 6, 7, 8, 9]

for i in nums:  # ვუვლით ასლს
    if i % 2 == 0 or nums.index(i) % 2 !=0:
        nums.remove(i)

print(nums)


# 2) შექმენით სია რომელშიც იქნება მხოლოდ სტრინგ მონაცემთა ტიპის ელემენტები, ამ სიის ბოლოში ცალ-ცალკე მეორედ ჩაამატე ყველა ის სიტყვა რაც უკვე არის ამ სიაში, გამოიყენეთ for ციკლი და სიის შესაბამისი ფუნქცია.

words = ["apple", "banana", "cherry"]

for i in words:
    words.append(i)

print(words)
