# 1) შექმენით სიტყვებით სავსე სია, თუ სიტყვის ყველა ასო არის პატარა, ანუ წერია lowercase-ში, ამ სიტყვის ყველა ასო გახადეთ დიდი.
# თუ სიტყვა შეიცავს თუნდაც ერთ uppercase ასოს, ეს სიტყვა ამოშალეთ სიიდან. ბოლოს დაპრინტეთ მიღებული სია. (არ შექმნათ ახალი სია, იმუშავეთ პირველ სიტყვების სიაშიგამოიყენეთ while ციკლი.

words = ["hello", "World", "python", "Code", "linux"]

i = 0 
while i < len(words):
    if words[i].islower():
        words[i] = words[i].upper()
        i += 1
    else:
        words.pop(i)

print(words)



# 2) შექმენით სტრინგის ცვლადი და ცარიელი სია. სტრინგში მყოფი დიდი ასოები გახადეთ პატარა და ამ სიაში ჩაამატეთ, ხოლო სტრინგში მყოფი პატარა ასოები გახადეთ დიდი და ასევე ჩააგდეთ ამ სიაში. დაპრინტეთ საბოლოო სია, გამოიყენეთ while ციკლი.

text = "PyThOnLiNuX"
result = []

i = 0
while i < len(text):
    if text[i].isupper():
        result.append(text[i].lower())
    else:
        result.append(text[i].upper())
    i += 1

print(result)



# 3) შექმენით სახელებით სავსე სია, ასევე შექმენით ცარიელი სია, თუ სიტყვის ყველა ასო არის პატარა, მაშინ ამ სიტყვის ყველა ასო გახადეთ დიდი და შესაბამისი სიის ფუნქციის გამოყენებით ჩასვით ეს სიტყვა ცარიელი სიის დასაწყისში, ხოლო თუ სიტყვის ყველა ასო არის დიდი, მაშინ ამ სიტყვის ყველა ასო გახადეთ პატარა და შესაბამისი სიის ფუნქციის გამოყენებით ჩასვით ეს სიტყვა ცარიელი სიის ბოლოში. ბოლოს დაპრინტეთ მიღებული სია. გამოიყენეთ for ციკლი.

names = ["gio", "NIKA", "mari", "LUKA", "dato"]
result = []

for i in names:
    if i.islower():
        result.insert(0, i.upper())
    elif i.isupper():
        result.append(i.lower())

print(result)



# 4) შექმენით ქალაქების სია, წაშალეთ pop() ან remove() ფუნქციით ყველა ის სიტყვა რომლის ყველა ასო არის დიდი, ხოლო ყველა სხვა სიტყვას ყველა ასო გაუხადეთ დიდი. დაპრინტეთ საბოლოო შედეგი. გამოიყენეთ while ციკლი.

cities = ["TBILISI", "batumi", "KUTAISI", "zugdidi", "POTI"]
i = 0

while i < len(cities):
    if cities[i].isupper():
        cities.pop(i)
    else:
        cities[i] = cities[i].upper()
        i += 1

print(cities)



# 6) შექმენით სტრინგის ცვლადი და ცარიელი სია, თუ სტრინგის ასო არის პატარა, მაშინ ცარიელ სიაში ჩაამატეთ "+" ნიშანი, ხოლო თუ სტრინგის ასო არის დიდი, მაშინ ცარიელ სიაში ჩაამატეთ "-" ნიშანი. თუ მინუსების რაოდენობა სიაში არის ლუწი, მაშინ წაშალე ყველა "+" ნიშანი, ხოლო თუ მინუსების რაოდენობა სიაში არის კენტი, წაშალე ყველა "-" ნიშანი. "+" და "-" -ების თავიდან სიაში ჩასაგდებად გამოიყენეთ for ციკლი, ხოლო "+" ან "-" -ების წასაშლელად გამოიყენეთ while ციკლი.

text = "aBcDeFGh"
symbols = []

for i in range(len(text)):
    if text[i].islower():
        symbols.append("+")

    elif text[i].isupper():
        symbols.append("-")

print(symbols)


# 8) შექმენით სტრინგის ცვლადი და შემოაბრუნეთ ეს სტრინგი. არ გამოიყენოთ slicing. და ყველა ასო გაუხადეთ დიდი. დაპრინტეთ საბოლოო სტრინგი.

text = "Python is fun"

reversed_upper = ""

for i in reversed(text):
    reversed_upper += i.upper()

print(reversed_upper)

