# 1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით

name = input("Enter your name:")

uppercase = name.upper()

print(uppercase)



# 2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით

Name = input("Enter your name with big letters:")

lowercase = Name.lower()

print(lowercase)


# 3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი

nAme = input("Enter your name:")

capitalized = nAme.capitalize()

print(capitalized)


# 4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული
# სახელი ოღონდ დიდი ასოებით


names = ["gaga, gega, giga, goga, guga"]

for i in names:
    print(i.upper())


# 5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული
# სახელი ოღონდ პატარა ასოებით

names = ["GAGA, GEGA, GIGA, GOGA, GUGA"]

for i in names:
    print(i.lower())



# 6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული
# სახელი ოღონდ პირველი ასო დიდიქონდეს

names = ["gaga", "gega", "giga", "goga", "guga"]

for i in names:
    print(i.capitalize())



# 7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ 
# ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს

fruits = ["apple", "banana", "cherry", "orange", "grape"]

print(len(fruits))



# 8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ
# ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს


name = "aleqsandre"

print(len(name))


# 9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა

numbers = [2, 5, 8, 11, 14, 17, 20]

even_count = 0  

for i in numbers:
    if i % 2 == 0:     
        even_count += 1

print("ლუწი რიცხვების რაოდენობაა:", even_count)



# 10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა

numbers = [2, 5, 8, 11, 14, 17, 20]

odd_count = 0

for i in numbers:
    if i % 2 != 0:
        odd_count += 1

print("კენტი რიცხვების რაოდენობაა:", odd_count)



# 11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი
# იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები

start = int(input("შეიყვანე საწყისი რიცხვი (start): "))
end = int(input("შეიყვანე ბოლო რიცხვი (end): "))
step = int(input("შეიყვანე ნაბიჯი (step): "))

for i in range(start, end, step):
    if i % 2 == 0:   # თუ რიცხვი ლუწია
        print(i)

