# 1) შექმენით წინადადების სტრინგის ცვლადი, ამ ცვლადში დაითვალეთ ხმოვანი ასოების რაოდენობა. გამოიყენეთ for ციკლი.
sentence = "სწავლა წარმატების გასაღებია"
vowels = "აეიოუ"
count = 0

for i in sentence:
    if i in vowels:
        count += 1

print("ხმოვანი ასოების რაოდენობა:", count)


# 2) შექმენით რიცხვებით სავსე სია და დაითვალეთ ამ სიაში მყოფი მხოლოდ ლუწი რიცხვების ჯამი, გამოიყენეთ for ციკლი.
numbers = [3, 6, 8, 1, 10, 7, 4]
even = 0

for i in numbers:
    if i % 2 == 0:
        even += i

print("ლუწი რიცხვების ჯამი:", even)


# 4) მომხმარებელს შემოატანინეთ პაროლი, თუ პაროლის სიგრძე არის 6-ზე ნაკლები, მაშინ თავიდან შემოატანინეთ ახალი პაროლი, როცა პაროლის სიგრძე იქნება 6 ან 6-ზე მეტი, გააჩერეთ ციკლი და დაპრინტეთ "Your password is correct!" გამოიყენეთ while ციკლი.
password = input("შეიყვანეთ პაროლი: ")

while len(password) < 6:
    print("Your password is correct!")
    password = input("შეიყვანეთ პაროლი: ")

print("Your password is correct!")


# 5) შექმენით რიცხვებით სავსე  სია რომელშიც რამდენიმე რიცხვი მეორდება და დაპრინტეთ სია გამეორებების გარეშე, აუცილებლად იგივე თანმიმდევრობით. მაგალითად: თუ მოცემული გვაქვს სია [3, 5, 3, 8, 5, 10, 8], მაშინ ჩვენ უნდა დავპრინტოთ [3, 5, 8, 10]  გამოიყენეთ for ციკლი.

numbers = [3, 5, 3, 8, 5, 10, 8]
nums = []

for i in numbers:
    if i not in nums:
        nums.append(i)

print(nums)


# 6) მომხმარებელს შემოატანინეთ წინადადება და ტერმინალში ყველა ახალ ხაზზე დაპრინტეთ ამ წინადადების სიტყვა და რიცხვი თუ რამდენჯერ მეორდება ეს სიტყვა წანადადებაში. მაგალითად: თუ მოცემული გვაქვს წინადადება "Hello I love apples Hello", მაშინ ტერმინალში ჯერ უნდა გამოვიდეს Hello 2, რადგან ეს სიტყვა 2-ჯერ მეორდება წინადადებაში, შემდეგ ხაზზე უნდა ეწეროს I 1, შემდეგ love 1, და ბოლოს apples 1. გამოიყენეთ სიები, არ გამოიყენოთ count() ფუნქცია.
sentence = input("შეიყვანეთ წინადადება: ")
words = sentence.split()
printed = []

for i in words:
    if i not in printed:
        count = 0
        for w in words:
            if w == i:
                count += 1
        print(i, count)
        printed.append(i)

# 7) შექმენით რაიმე რიცხვის ცვლადი და მომხმარებელს შემოატანინეთ რიხვი, მომხმარებელმა უნდა შეეცადოს რომ გამოიცნოს ჩვენი რიცხვი, თუ მისი შემოტანილი რიცხვი არ უდრის ჩვენს რიცხვს, მაშინ ისევ თავიდან შემოატანინეთ მანამ სანამ არ გამოიცნობს. როცა ჩვენს რიცხვს გამოიცნობს, დაპრინტეთ თუ რამდენი ცდა მოუწია მანამ სანამ გამოიცნო, მაგალითად: "Correct! Attempts: 10" გამოიყენეთ while ციკლი.

secret_number = 7
attempts = 0

guess = int(input("Guess the number: "))
attempts += 1

while guess != secret_number:
    print("Try again!")
    guess = int(input("Guess the number: "))
    attempts += 1

print(f"Correct! Attempts: {attempts}")


