# 2) მომხმარებელს შემოატანინეთ სტრინგი რომელშიც იქნება ასოებიც და რიცხვებიც, მაგალითად - "G3lkij6m7m844", ჩვენი დავალებაა რომ დავპრინტოთ ამ სტრინგში მყოფი რიცხვების ჯამი. დღეს ვისწავლეთ მაგრამ ამ დავალებაში არ გამოიყენოთ split() ფუნქცია.
num_word = input("Enter string and integer: ")
nums = "0123456789"
sumof = 0

for i in num_word:
    if i in nums:
        sumof += int(i)

print(sumof)




# 3) მომხმარებელს შემოატანინეთ წინადადება რომელიც იწყება რამდენიმე სფეისით, ცარიელი ადგილებით, და ყოველ სიტყვებს შორის იყოს ერთის მაგივრად რამდენიმე ცარიელი ადგილი, და წინადადება ასევე დამთავრდეს რამდენი სფეისით, მაგალითად: "    I    love    Python    ". თქვენი დავალებაა რომ დაპრინტოთ მომხმარებლის მოცემული წინადადება ჩვეულებრივი, ერთ-ერთი სფეისების გამოტოვებით, ამ შემთხვევაში ასე - "I love Python".

