# 2) მომხმარებელს შემოატანინეთ სტრინგი რომელშიც იქნება ასოებიც და რიცხვებიც, მაგალითად - "G3lkij6m7m844", ჩვენი დავალებაა რომ დავპრინტოთ ამ სტრინგში მყოფი რიცხვების ჯამი. დღეს ვისწავლეთ მაგრამ ამ დავალებაში არ გამოიყენოთ split() ფუნქცია.
num_word = input("Enter string and integer: ")
nums = "0123456789"
sumof = 0

for i in num_word:
    if i in nums:
        sumof += int(i)

print(sumof)




# 3) მომხმარებელს შემოატანინეთ წინადადება რომელიც იწყება რამდენიმე სფეისით, ცარიელი ადგილებით, და ყოველ სიტყვებს შორის იყოს ერთის მაგივრად რამდენიმე ცარიელი ადგილი, და წინადადება ასევე დამთავრდეს რამდენი სფეისით, მაგალითად: "    I    love    Python    ". თქვენი დავალებაა რომ დაპრინტოთ მომხმარებლის მოცემული წინადადება ჩვეულებრივი, ერთ-ერთი სფეისების გამოტოვებით, ამ შემთხვევაში ასე - "I love Python".
text = input("შეიყვანე წინადადება: ")  
words = text.split()                   
result = ""                             

i = 0
while i < len(words):                  
    result += words[i]               
    if i != len(words) - 1:              
        result += " "                  
    i += 1                               

print(result)                             

# 4) შექმენით რიცხვებით სავსე სტრინგი, თქვენი დავალებაა დაითვალოთ და დაპრინტოთ თუ რამდენი რიცხვი არის მის უკან მდგომ რიცხვზე დიდი. მაგალითად თუ გვაქვს მოცემული სია - [1, 3,  2, 4, 6, 5], 3 > 1, 4 > 2, 6 > 4, გამოდის რომ გვაქვს ასეთი 3 რიცხვი, დავპრინტავთ მათ რაოდენობას, 3-ს.
numbers = [1, 3, 2, 4, 6, 5]  
count = 0                      
i = 1                          

while i < len(numbers):
    if numbers[i] > numbers[i - 1]:  
        count += 1                   
    i += 1                           

print(count)