#print ("hello world")
#string --> str --> "აქ ვწერთ ნებისმიერ რამეს"
#integer --> int --> ნებისმიერი მთელი რიცხვი, მაგალითად: 2,4,6,10,55,34,21.
#float--> წილადი რიცხვები მაგალითად:2.4 2.90 5.1 4.30 6.1

#მათემატიკური ოპერატორები : + - * /

print(2 + 80)
print(50 - 40.43)
print(5 * 4)
print(20 / 5)

#სტრინგისა და ინტეჯერის ერთმანეთთან დამატება არ შეიძლება result --> error

print("Giga" + 20) # result --> error

#parantheses = ფრჩხილები = ( )
#quotation marks = ბრჭყალები = ""
#variables = ცვლადი (ყუთი, კონტეინერი)
#value = მნიშვნელობა 
#equal sign = ტოლობის ნიშანი
#underscore --> ( _ ) ანუ ქვედა ტირე

#სტრინგების დამატებას (შეერთებას) ეწოდება "კონკატინაცია"
print("dexter" + "rita")

#ცვლადების მიმატება

x = 40

y = 130

k = x + y # ცვლადებში შეგვიძლია ასევე შევინახოთ არა მხოლოდ ელემენტები, არამედ შევინახოთ რაიმე მოქმედების შედეგი

print(k)
