# პირველ გაკვეთილზე შევისწავლე 5 მონაცემთა ტიპი: string(სტრინგი) , integer(ინტეჟერი) , float , boolean (ბულიონ) და print.
#ამ მოცემულ მონაცემთა ტიპებს აქვთ ინდივიდუალურად მინიჭებული ფუნქცია ან ფუნქციები მაგალითისთვის მოვიყვანოთ:
#string = str -- ტექსტი რომელიც მოცემული გვაქვს ბრჭყალებში მაგ: "Giga", "manqana", "mwvadi", "150", "15"
#integer = int -- ინტეჯერი არის მთელი რიცხვები მაგ: 20, 50, 43, 1546, 10, 150
#float -- ათწილადი რიცხვები მაგ: 14.50 , 145.40 , 5.5 , 6.80
#boolean(ბულიონ) -- ბულეანს გადაეცემა მხოლოდ ორი მნიშვნელობა True და False
#print -- არის ფუნქცია რომელსაც გამოაქვს შედეგი ტერმინალში

#ეხლა საცდელად პრინტით გამოვიტანოთ თითოეული მონაცემთა ტიპის მქონე ელემენტი ტერმინალში

print("Giga")
print(15)
print(1.73)

#ახლა ვისაუბროთ ცვლადზე, ცვლადი(ყუთი , კონტეინერი) რომელიც ინახავს ღირებულებას ნივთს (value)  და კოდის წერისას შეგვიძლია
#ცვლადში შევინახოთ რაიმე ღირებული მაგალითისთვის

Name = "Giga"
Age = "15"
Height = "1.73"
Car = "BMW"


