# 1) შექმენით სია სადაც გექნებათ მოთავსებული მხოლოდ და მხოლოდ სტრინგ ტიპის მონაცემები(სიაში შეიყვანეთ 10 სახელი),თქვენი დავალებაა ამ სიიდან გამოიტანოთ თითეული სახელი ოღნდ ცალ ცალკე,გამოიოყენეთ ინდექსინგი

manqanebi = [
    "BMW",
    "Mercedes-Benz",
    "Audi",
    "Toyota",
    "Honda",
    "Ford",
    "Chevrolet",
    "Nissan",
    "Hyundai",
    "Kia"
]

# ინდექსირებით თითოეულის გამოტანა
print(manqanebi[0])
print(manqanebi[1])
print(manqanebi[2])
print(manqanebi[3])
print(manqanebi[4])
print(manqanebi[5])
print(manqanebi[6])
print(manqanebi[7])
print(manqanebi[8])
print(manqanebi[9])



# 2) შექმენით ცვლადი სადაც შეინახავთ ბოსტნეულის სახელებს,უნდა გქონდეთ სულ 6 ბოსტნეულის სახელი,თქვენი დავალებაა რომ ამ სიაში მყოფი მე 0 ე ინდექსზე მდგომი ელემენტი ჩაანაცვლოთ "viri" ით ,ამ სიაშ მყოფი მესამე დ=ინდექსზე მდგომი ელემენტი ჩაანაცვლოთ "tagvit" და ამ სიაში მყოფი მეხუთე ინდექსზე მდგომი ელემენტი ჩაანაცვლოთ "bokveri" ით, როდესაც შეცვლი სამივე მნიშვნელობას დაპრინტე საბოლოო განახლებული სია


# 6 ბოსტნეულის სიის შექმნა
bostneulebi = ["კახრი", "კიტრი", "ბადრიჯანი", "პომიდორი", "ბოლოკი", "კარტოფილი"]

# ელემენტების ჩანაცვლება
bostneulebi[0] = "ვირი"       # 0 ინდექსზე
bostneulebi[3] = "თაგვიტ"     # 3 ინდექსზე
bostneulebi[5] = "ბოკვერი"    # 5 ინდექსზე

# საბოლოო განახლებული სია
print(bostneulebi)

