# 1)შექმენით სია -->  ["ina" , "givi" , "nika" , "daviti" , "ia" , "lizi"] , თქვენი დავალებაა რომ პირველი 2 ელემენტი ჩაანაცვლოთ შემდეგი სიით
#  --> ["irina" , "milana" , "kira", "mate"] //////////////// და ასევე სიის ბოლო ორი ელემენტი შეანაცვლე შემდეგი სიით
#   --> ["gia" , "emzari" , "xvicha"] ამის შემდეგ დაპრინტეთ საბოლოო სია


# საწყისი სია
names = ["ina", "givi", "nika", "daviti", "ia", "lizi"]

# პირველი 2 ელემენტის ჩანაცვლება
names[0:2] = ["irina", "milana", "kira", "mate"]

# ბოლო 2 ელემენტის ჩანაცვლება
names[-2:] = ["gia", "emzari", "xvicha"]

# საბოლოო სიის დაბეჭდვა
print(names)
