/*
1)მომხმარებელს prompt()-ით შეაყვანინე ასაკი.

თუ ასაკი 18 ან მეტია, გამოიტანე „სრულწლოვანი ხარ“.

თუ ასაკი 18-ზე ნაკლებია, გამოიტანე „არასრულწლოვანი ხარ“.

თუ შეყვანილი ასაკი უარყოფითია, გამოიტანე „არასწორი ასაკი“.
*/

let age = Number(prompt("გთხოვთ, შეიყვანოთ თქვენი ასაკი:"))

if (age < 0) {
    console.log("არასწორი ასაკი")
} else if (age >= 18) {
    console.log("სრულწლოვანი ხარ")
} else {
    console.log("არასრულწლოვანი ხარ")
}




/*
2)მომხმარებელს შეაყვანინე პაროლი.

გამოიყენე trim(), რათა პაროლს დასაწყისში და ბოლოში არსებული გამოტოვებები მოაშორო.

თუ პაროლი არის "javascript123", გამოიტანე „სწორი პაროლია“.

თუ პაროლი ცარიელია, გამოიტანე „პაროლი არ შეგიყვანია“.

სხვა შემთხვევაში გამოიტანე „არასწორი პაროლი“.
*/

let password = prompt("შეიყვანეთ პაროლი:").trim()

if (password === "") {
    console.log("პაროლი არ შეგიყვანია")
} else if (password === "javascript123") {
    console.log("სწორი პაროლია")
} else {
    console.log("არასწორი პაროლი")
}



/*
3)რიცხვის კატეგორია

მომხმარებელს შეაყვანინე რიცხვი.

თუ რიცხვი დადებითია, გამოიტანე „დადებითი“.

თუ რიცხვი უარყოფითია, გამოიტანე „უარყოფითი“.

თუ რიცხვი ნულის ტოლია, გამოიტანე „ნული“.
*/

let number = Number(prompt("შეიყვანეთ რიცხვი:"))

if (number > 0) {
    console.log("დადებითი")
} else if (number < 0) {
    console.log("უარყოფითი")
} else {
    console.log("ნული")
}