/*
1)მომხმარებელს prompt()-ით შეაყვანინე ასაკი.

თუ ასაკი 18 ან მეტია, გამოიტანე „სრულწლოვანი ხარ“.

თუ ასაკი 18-ზე ნაკლებია, გამოიტანე „არასრულწლოვანი ხარ“.

თუ შეყვანილი ასაკი უარყოფითია, გამოიტანე „არასწორი ასაკი“.
*/

let age = Number(prompt("გთხოვთ, შეიყვანოთ თქვენი ასაკი:"))

if (age < 0) {
    console.log("არასწორი ასაკი")
} else if (age >= 18) {
    console.log("სრულწლოვანი ხარ")
} else {
    console.log("არასრულწლოვანი ხარ")
}




/*
2)მომხმარებელს შეაყვანინე პაროლი.

გამოიყენე trim(), რათა პაროლს დასაწყისში და ბოლოში არსებული გამოტოვებები მოაშორო.

თუ პაროლი არის "javascript123", გამოიტანე „სწორი პაროლია“.

თუ პაროლი ცარიელია, გამოიტანე „პაროლი არ შეგიყვანია“.

სხვა შემთხვევაში გამოიტანე „არასწორი პაროლი“.
*/

let password = prompt("შეიყვანეთ პაროლი:").trim()

if (password === "") {
    console.log("პაროლი არ შეგიყვანია")
} else if (password === "javascript123") {
    console.log("სწორი პაროლია")
} else {
    console.log("არასწორი პაროლი")
}



/*
3)რიცხვის კატეგორია

მომხმარებელს შეაყვანინე რიცხვი.

თუ რიცხვი დადებითია, გამოიტანე „დადებითი“.

თუ რიცხვი უარყოფითია, გამოიტანე „უარყოფითი“.

თუ რიცხვი ნულის ტოლია, გამოიტანე „ნული“.
*/

let number = Number(prompt("შეიყვანეთ რიცხვი:"))

if (number > 0) {
    console.log("დადებითი")
} else if (number < 0) {
    console.log("უარყოფითი")
} else {
    console.log("ნული")
}


/*
4)მომხმარებელს შეაყვანინე სახელი.

გამოიყენე trim(), რათა ზედმეტი გამოტოვებები მოაშორო.

გამოიყენე toLowerCase(), რათა სახელი პატარა ასოებით მიიღო.

თუ სახელი "goga"-ს უდრის, გამოიტანე „გამარჯობა, გოგა!“.

თუ სახელი "admin"-ია, გამოიტანე „მოგესალმები ადმინისტრატორო!“.

სხვა შემთხვევაში გამოიტანე „მომხმარებელი ვერ მოიძებნა“.
*/

let name = prompt("შეიყვანე სახელი:").trim().toLowerCase()

if (name === 'goga') {
    console.log('გამარჯობა, გოგა!')
} else if (name === 'admin') {
    console.log('მოგესალმებით, ადმინისტრატორო!')
} else {
    console.log('მომხმარებელი არ მოიძებნა')
}



/*
5)მომხმარებელს შეაყვანინე ელფოსტის მისამართი.

გამოიყენე trim() და toLowerCase().

თუ მისამართი "admin@gmail.com"-ის ტოლია, გამოიტანე „ადმინისტრატორის ანგარიში“.

თუ მისამართი მთავრდება "@gmail.com"-ით, გამოიტანე „Gmail-ის მომხმარებელი“.

თუ მისამართი მთავრდება "@outlook.com"-ით, გამოიტანე „Outlook-ის მომხმარებელი“.

სხვა შემთხვევაში გამოიტანე „უცნობი ელფოსტის მისამართი“.

გამოიყენე endsWith() და შედარების ოპერატორები.
*/


let email = prompt('შეიყვანეთ ელფოსტის მისამართი: ').trim().toLowerCase()

if (email === 'admin@gmail.com') {
    console.log('ადმინისტრატორის ანგარიში')
} else if (email.endsWith('@gmail.com')) {
    console.log('Gmail-ის მომხმარებელი')
} else if (email.endsWith('@outlook.com')) {
    console.log('outlook-ის მომხმარებელი')
} else {
    console.log('უცნობი ელფოსტის მისამართი')
}



/*
6)მომხმარებელს შეაყვანინე მომხმარებლის სახელი.

მოაშორე ზედმეტი გამოტოვებები trim()-ით.

თუ სახელი ცარიელია, გამოიტანე „სახელი აუცილებელია“.

თუ სახელი 3 სიმბოლოზე ნაკლებია, გამოიტანე „სახელი ძალიან მოკლეა“.

თუ სახელი 12 სიმბოლოზე მეტია, გამოიტანე „სახელი ძალიან გრძელია“.

თუ სახელი "admin"-ით იწყება, გამოიტანე „ადმინისტრატორის სახელის გამოყენება აკრძალულია“.

სხვა შემთხვევაში გამოიტანე „მომხმარებლის სახელი მიღებულია“.
*/


let username = prompt("შეიყვანეთ მომხმარებლის სახელი:")

username = username.trim()

if (username === "") {
    console.log("სახელი აუცილებელია")
} else if (username.length < 3) {
    console.log("სახელი ძალიან მოკლეა")
} else if (username.length > 12) {
    console.log("სახელი ძალიან გრძელია")
} else if (username.startsWith("admin")) {
    console.log("ადმინისტრატორის სახელის გამოყენება აკრძალულია");
} else {
    console.log("მომხმარებლის სახელი მიღებულია")
}



/*
7)მომხმარებელს შეაყვანინე ტექსტი.

გამოიყენე trim() და toLowerCase().

თუ ტექსტი "open sesame"-ის ტოლია, გამოიტანე „საიდუმლო კარი გაიღო“.

თუ ტექსტი "open"-ით იწყება, გამოიტანე „კოდი არასრულია“.

თუ ტექსტი "close"-ით იწყება, გამოიტანე „კარი დაიხურა“.

თუ ტექსტის სიგრძე 5 სიმბოლოზე ნაკლებია, გამოიტანე „ტექსტი ძალიან მოკლეა“.

სხვა შემთხვევაში გამოიტანე „უცნობი ბრძანება“.
*/


let text = prompt("შეიყვანეთ ტექსტი:")

text = text.trim().toLowerCase()

if (text === "open sesame") {
    console.log("საიდუმლო კარი გაიღო")
} else if (text.startsWith("open")) {
    console.log("კოდი არასრულია")
} else if (text.startsWith("close")) {
    console.log("კარი დაიხურა")
} else if (text.length < 5) {
    console.log("ტექსტი ძალიან მოკლეა")
} else {
    console.log("უცნობი ბრძანება")
}



/*
8)შექმენი პროგრამა, რომელიც მომხმარებელს შეაყვანინებს ასაკს, ბილეთის ტიპს და მომხმარებლის სახელს.

პირობები:

ასაკის შეყვანისას შეამოწმე, რომ ის 0-ზე მეტია.

თუ ასაკი 12-ზე ნაკლებია, ბილეთის ფასი 5 ლარია.

თუ ასაკი 12-დან 17 წლამდეა, ფასი 8 ლარია.

თუ ასაკი 18 ან მეტია, ფასი 15 ლარია.

ბილეთის ტიპი შეამოწმე toLowerCase()-ით:

"vip" — დაამატე 10 ლარი.

"standard" — ფასი არ შეცვალო.

სხვა შემთხვევაში გამოიტანე „ბილეთის ტიპი არასწორია“.

მომხმარებლის სახელს მოაშორე ზედმეტი გამოტოვებები.

თუ სახელი "admin"-ის ტოლია, გამოიტანე „ადმინისტრატორისთვის ბილეთი უფასოა“.

საბოლოოდ გამოიტანე მომხმარებლის სახელი და გადასახდელი თანხა.

გაითვალისწინე, რომ არასწორი ასაკის ან ბილეთის ტიპის შემთხვევაში პროგრამამ არ უნდა გააგრძელოს ფასის გამოთვლა.
*/


let age1 = Number(prompt("შეიყვანეთ ასაკი:"))
let ticketType = prompt("შეიყვანეთ ბილეთის ტიპი:")
let username1 = prompt("შეიყვანეთ სახელი:")

username1 = username1.trim()

if (age1 <= 0) {
    console.log("ასაკი არასწორია");
} else if (ticketType.toLowerCase() !== "standard" && ticketType.toLowerCase() !== "vip") {
    console.log("ბილეთის ტიპი არასწორია");
} else if (username1.toLowerCase() === "admin") {
    console.log("ადმინისტრატორისთვის ბილეთი უფასოა")
} else {
    let price = 0

    if (age1< 12) {
        price = 5
    } else if (age1 <= 17) {
        price = 8
    } else {
        price = 15
    }

    if (ticketType.toLowerCase() === "vip") {
        price = price + 10
    }

    console.log(username1 + ", გადასახდელი თანხა: " + price + " ლარი")
}


/*
9)ტექსტის ანალიზატორი

მომხმარებელს შეაყვანინე წინადადება და შეასრულე შემდეგი მოქმედებები:

გამოიყენე trim(), რათა მოაშორო ზედმეტი გამოტოვებები.

თუ წინადადება ცარიელია, გამოიტანე „ტექსტი არ შეგიყვანია“.

თუ წინადადება "javascript"-ით იწყება, გამოიტანე „ეს ტექსტი JavaScript-ზეა“.

თუ წინადადება 20 სიმბოლოზე მეტია, გამოიტანე მისი პირველი 10 სიმბოლო slice()-ის გამოყენებით.

თუ წინადადება "!"-ით მთავრდება, გამოიტანე „ტექსტი ემოციურია“.

თუ წინადადება "?"-ით მთავრდება, გამოიტანე „ეს შეკითხვაა“.

თუ წინადადებაში არის "bad", შეცვალე ის "good"-ით replaceAll()-ის გამოყენებით.

სხვა შემთხვევაში გამოიტანე ტექსტი დიდი ასოებით.
*/


let text1 = prompt("შეიყვანეთ წინადადება:")

text1 = text1.trim()

if (text === "") {
    console.log("ტექსტი არ შეგიყვანია")
} else if (text1.toLowerCase().startsWith("javascript")) {
    console.log("ეს ტექსტი JavaScript-ზეა")
} else if (text1.length > 20) {
    console.log(text.slice(0, 10))
} else if (text1.endsWith("!")) {
    console.log("ტექსტი ემოციურია")
} else if (text1.endsWith("?")) {
    console.log("ეს შეკითხვაა")
} else if (tex1t.includes("bad")) {
    console.log(text1.replaceAll("bad", "good"))
} else {
    console.log(text1.toUpperCase())
}


